"""
.. _ref_introduction:

Introduction
============
本例演示了如何加载一个 solution 并访问一些基本帮助。
"""
###############################################################################
# Perform required imports
# ------------------------
# **执行所需的导入**

from ansys.dpf import post
from ansys.dpf.post import examples

###############################################################################
# Get ``Solution`` object
# -----------------------
# **获取 ``Solution`` 对象**

###############################################################################
# 本例加载 PyDPF-Post 提供的一个简单文件。

simple_bar = examples.simple_bar
solution = post.load_solution(simple_bar)

###############################################################################
# Use helpers
# -----------
# **使用 helpers**


###############################################################################
# Get solution information
# ~~~~~~~~~~~~~~~~~~~~~~~~
# **获取 solution 信息**

print(solution)

###############################################################################
# Get locations information
# ~~~~~~~~~~~~~~~~~~~~~~~~~
# **获取位置信息**

###############################################################################
# location 用于定义必须在哪里设置结果。

help(post.locations)

###############################################################################
# Get available keywords
# ~~~~~~~~~~~~~~~~~~~~~~
# **获取可用的关键字**

###############################################################################
# 关键字可用作 ``Result`` 对象的属性。

post.print_available_keywords()
